PATH = 'csvs/nutri_records.csv'

NUMBER_OF_FOOD_SUB_GROUPS = 32
NUMBER_OF_FOOD_GROUP = 11

MACROS = ['protein', 'total_fat', 'carbohydrates']

ISRAEL_OFFICIAL_DATA_PATH = 'csvs\moh_mitzrachim_1.7.2021.csv'

LABELED_FOODS_FOR_SWITCH_NUMBERS_TO_NAMES = {
  56208068:	'1.1 דגנים מלאים',
  51140668:	'1.2 דברי מאפה (לחמים) מדגן מלא',
  56204930:	'1.3 דגנים לא מלאים',
  51101009:	'1.4 דברי מאפה (לחמים) מדגן לא מלא',
  71001040:	'1.5 ירקות עמילניים',
  58126148:	'1.6 דברי מאפה מלוחים',
  53510019:	'1.7 דברי מאפה מתוקים',
  57208099:	'1.8 מידגנים (Cereals)',
  92530229:	'10.1 משקאות ממותקים בסוכר',
  64105419:	'10.2 משקאות ממותקים בתחליפי סוכר',
  92205000:	'10.3 משקאות אורז/ שיבולת שועל',
  93504000:	'10.4.1 משקאות אלכוהוליים לא מתוקים',
  93401010:	'10.4.2 משקאות אלכוהוליים שמכילים פחמימות',
  75100780:	'2 קבוצת הירקות',
  63149010:	'3 קבוצת הפירות',
  41101219:	'4 קבוצת קטניות',
  42116000:	'5.1 קבוצת אגוזים וגרעינים',
  43103339:	'5.2 קבוצת שמנים צמחיים',
  83107000:	'5.3 שומנים מהחי',
  90000007:	'6.1 מוצרי חלב לא ממותקים',
  11411609:	'6.2 מוצרי חלב ממותקים בסוכר',
  11511269:	'6.3 קבוצת מוצרי חלב ממותקים בתחליפי סוכר- כל הדיאט',
  41420010:	'6.4 קבוצת תחליפי חלב על בסיס קטניות- מוצרי סויה',
  24102010: '8.1 קבוצת הבשר- עוף הודו',
  26115108:	'8.2 קבוצת הבשר- דגים',
  23200109:	'8.3 קבוצת הבשר- בשר בקר וצאן',
  50030109:	'8.4 קבוצת הבשר- תחליפי בשר מהצומח',
  91703070:	'9. קבוצת הסוכרים',
  31104000:	'ביצים 7',
  14210079:	'מוצרי חלב דל שומן',
  95312600:	'משקה אנרגיה',
  41811939:	'תחליפי בשר (לייט)'
}

# you can use it with -> mask_by_part_of_a_word_in_df(string_series, pattern, include=True)
FILTER = 'מלבין קפה|תחליף|אבקה|תחליף נוזלי|תחליף לארוחה|תחליף או תוסף|תחליף או תוספת|משקה|ארטישוק ירושלמי, חי, עם קליפה|ביצה חלבון מיובש|סויה, חלבון סויה|תמ"י|גלוטן חיטה, יבש|מרק|תבלינים|תפוח אדמה, חי|סלט|רימון חי, עם קליפה|תמצית|תמ"ל|אבקה' + 'מי גבינה|מועשר|עם קליפה|תוספת|איזיליין|תמ"י|תחליף|FIBER|תמ"ל|לפגים|מטרנה|איזומיל|סימילאק|אבקת|ביצה עם קליפה|אומגה|באומגה|אנשור|לתינוק|protein|גלעין|עמילן|פסולת|whey|ויטמין|פגים'